backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.create(user_params)